-- MySQL dump 10.13  Distrib 8.0.34, for Win64 (x86_64)
--
-- Host: k9c105.p.ssafy.io    Database: kkalong
-- ------------------------------------------------------
-- Server version	8.1.0

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `section`
--

DROP TABLE IF EXISTS `section`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `section` (
  `section_seq` int NOT NULL AUTO_INCREMENT COMMENT '인덱스',
  `section_name` varchar(40) NOT NULL COMMENT '상세구역 이름',
  `is_section_deleted` tinyint(1) NOT NULL DEFAULT '0' COMMENT '삭제여부',
  `section_del_date` datetime DEFAULT NULL COMMENT '삭제일시',
  `closet_seq` int NOT NULL COMMENT '옷장 인덱스',
  `sort_seq` int NOT NULL COMMENT '옷장 상세 종류 인덱스',
  PRIMARY KEY (`section_seq`),
  KEY `FK_closet_TO_section_1` (`closet_seq`),
  KEY `FK_sort_TO_section_1` (`sort_seq`),
  CONSTRAINT `FK_closet_TO_section_1` FOREIGN KEY (`closet_seq`) REFERENCES `closet` (`closet_seq`),
  CONSTRAINT `FK_sort_TO_section_1` FOREIGN KEY (`sort_seq`) REFERENCES `sort` (`sort_seq`)
) ENGINE=InnoDB AUTO_INCREMENT=107 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `section`
--

LOCK TABLES `section` WRITE;
/*!40000 ALTER TABLE `section` DISABLE KEYS */;
INSERT INTO `section` VALUES (1,'구역태스트',0,NULL,1,8),(2,'구역태스트',0,NULL,2,9),(3,'MySection1',1,'2023-11-12 17:32:47',11,1),(4,'섹션1',0,NULL,12,9),(5,'나만의 섹션\n',0,NULL,12,10),(6,'섹션1',1,'2023-11-14 09:15:40',13,9),(7,'나만의 섹션\n',1,'2023-11-14 09:25:34',13,10),(8,'섹션병경테스트',1,'2023-11-15 14:07:03',14,7),(9,'오른쪽 선반',1,'2023-11-10 15:18:19',14,7),(10,'위쪽박스',1,'2023-11-15 14:07:03',14,9),(11,'위쪽박스',1,'2023-11-15 14:07:03',14,9),(12,'위쪽박스',1,'2023-11-10 17:09:17',14,9),(13,'섹션1',1,'2023-11-16 15:55:11',15,9),(14,'나만의 섹션\n',1,'2023-11-16 15:55:11',15,10),(15,'위쪽행거테스',1,'2023-11-15 14:07:03',14,8),(16,'위쪽행거테스',1,'2023-11-15 14:07:03',14,8),(17,'위쪽행거테스',1,'2023-11-15 14:07:03',14,8),(18,'위쪽행거테스',1,'2023-11-15 14:07:03',14,8),(19,'위쪽행거테스',1,'2023-11-15 14:07:03',14,8),(20,'asdasd',1,'2023-11-12 17:35:50',10,8),(21,'선반 제발1',0,NULL,16,7),(22,'선반 제발2',0,NULL,16,7),(23,'행거1',0,NULL,17,8),(24,'행거2',0,NULL,17,8),(25,'행거1',1,'2023-11-13 15:55:09',18,8),(26,'행거1',1,'2023-11-13 16:37:03',19,8),(27,'행거1',1,'2023-11-13 19:44:17',20,8),(28,'행거1',1,'2023-11-13 17:16:38',21,8),(29,'행거2',1,'2023-11-13 17:16:38',21,8),(30,'ssss',1,'2023-11-14 09:27:33',13,8),(31,'234',1,'2023-11-14 09:27:33',13,10),(32,'bravo',1,'2023-11-16 15:53:40',13,10),(33,'bigbox',1,'2023-11-14 15:02:37',13,9),(34,'hey',1,'2023-11-16 15:53:40',13,10),(35,'asf',1,'2023-11-16 15:53:40',13,7),(36,'수납장1',1,'2023-11-16 10:43:20',22,10),(37,'수납장1',1,'2023-11-16 10:42:13',23,10),(38,'수납장1',1,'2023-11-16 10:42:09',24,10),(39,'수납장2',1,'2023-11-16 10:42:09',24,10),(40,'bjj',1,'2023-11-15 10:35:13',22,7),(41,'gjj',1,'2023-11-16 10:43:20',22,10),(42,'행거1',1,'2023-11-16 10:42:05',25,8),(43,'수납장1',1,'2023-11-16 10:42:05',25,10),(44,'수납장2',1,'2023-11-16 10:42:05',25,10),(45,'선반1',1,'2023-11-16 10:42:05',25,7),(46,'행거1',1,'2023-11-16 10:42:00',26,8),(47,'선반1',1,'2023-11-16 10:42:00',26,7),(48,'박스1',1,'2023-11-16 10:42:00',26,9),(49,'행거1',1,'2023-11-15 15:20:23',27,8),(50,'수납장1',1,'2023-11-15 15:20:23',27,10),(51,'선반1',1,'2023-11-15 15:20:23',27,7),(52,'박스1',1,'2023-11-15 15:20:23',27,9),(53,'선반 1',0,NULL,28,7),(54,'선반 2',0,NULL,28,7),(55,'행거1',0,NULL,29,8),(56,'수납장1',0,NULL,29,10),(57,'행거1',1,'2023-11-16 10:41:55',30,8),(58,'수납장1',1,'2023-11-16 10:41:55',30,10),(59,'행거1',1,'2023-11-16 11:25:20',31,8),(60,'선반1',1,'2023-11-16 11:25:20',31,7),(61,'행거1',0,NULL,32,8),(62,'수납장1',0,NULL,32,10),(63,'선반1',0,NULL,32,7),(64,'박스1',0,NULL,32,9),(65,'행거1',0,NULL,33,8),(66,'행거2',0,NULL,33,8),(67,'박스1',0,NULL,33,9),(68,'행거1',1,'2023-11-16 11:24:08',34,8),(69,'수납장1',1,'2023-11-16 11:24:08',34,10),(70,'행거1',0,NULL,35,8),(71,'수납장1',0,NULL,35,10),(72,'선반1',0,NULL,35,7),(73,'박스1',0,NULL,35,9),(74,'행거1',0,NULL,36,8),(75,'수납장1',0,NULL,36,10),(76,'행거1',1,'2023-11-16 11:25:04',37,8),(77,'수납장1',1,'2023-11-16 11:25:04',37,10),(78,'행거1',1,'2023-11-16 11:28:37',38,8),(79,'행거1',1,'2023-11-16 15:43:38',39,8),(80,'행거1',1,'2023-11-16 15:50:40',40,8),(81,'계절옷 보관',0,NULL,41,9),(82,'양말 수납장\n',0,NULL,42,10),(83,'겉옷 행거',1,'2023-11-16 15:17:04',43,8),(84,'행거 1',0,NULL,44,8),(85,'기타 수납',1,'2023-11-16 15:19:59',44,10),(86,'선반 1',0,NULL,44,7),(87,'수납장 1',0,NULL,44,10),(88,'박스 1',0,NULL,44,9),(89,'행거1',0,NULL,48,8),(90,'행거1',0,NULL,46,8),(91,'행거1',0,NULL,47,8),(92,'행거1',0,NULL,45,8),(93,'행거1',1,'2023-11-16 17:01:45',49,8),(94,'수납장1',1,'2023-11-16 17:01:45',49,10),(95,'수납장2',1,'2023-11-16 17:01:45',49,10),(96,'선반1',1,'2023-11-16 17:01:45',49,7),(97,'박스1',1,'2023-11-16 17:01:45',49,9),(98,'박스2',1,'2023-11-16 17:01:45',49,9),(99,'행거1',1,'2023-11-16 17:01:51',50,8),(100,'수납장1',1,'2023-11-16 17:01:51',50,10),(101,'선반1',1,'2023-11-16 17:01:51',50,7),(102,'박스1',1,'2023-11-16 17:01:51',50,9),(103,'행거1',0,NULL,51,8),(104,'행거2',0,NULL,51,8),(105,'수납장1',0,NULL,51,10),(106,'박스1',0,NULL,51,9);
/*!40000 ALTER TABLE `section` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-11-17 10:00:31
